//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2007 MAYO.
//=============================================================================
#pragma once

namespace wx {

//-----------------------------------------------------------------------------
//! @class	ClipBoard
//! @brief	クリップボード操作
//-----------------------------------------------------------------------------
class ClipBoard
{
public:
	//-------------------------------------------------------------------------
	//! @brief	クリップボードを開く
	//!
	//! @param	owner		オーナーとなるウィンドウ(NULL可能)
	//!
	//! @retval	true		クリップボードを開けた
	//! @retval	false		クリップボードを開けなかった
	//-------------------------------------------------------------------------
	static bool Open(HWND owner);


	//-------------------------------------------------------------------------
	//! @brief	クリップボードを閉じる
	//-------------------------------------------------------------------------
	static void Close();


	//-----------------------------------------------------------------------------
	//! @brief	クリップボードを空にする
	//!
	//! @retval	true		クリップボードを空にできた
	//! @retval	false		クリップボードを空にできなかった
	//-----------------------------------------------------------------------------
	static bool Empty();


	//-----------------------------------------------------------------------------
	//! @brief	クリップボードにデータを貼り付ける
	//!
	//! @param	format		データ形式
	//! @param	data		貼り付けるデータ
	//! @param	size		データサイズ
	//!
	//! @retval	true		貼り付けられた
	//! @retval	false		貼り付けられなかった
	//-----------------------------------------------------------------------------
	static bool SetData(UINT format, void*  data, UINT  size);


private:
	// インスタンス生成禁止
	ClipBoard();
	~ClipBoard();
};

} //namespace wx
