//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2008 MAYO.
//=============================================================================
#pragma once

#include <windows.h>
#include "wx_misc.h"

namespace wx {

//-----------------------------------------------------------------------------
//! @class	Dialog
//! @brief	ダイアログボックス表示
//-----------------------------------------------------------------------------
class Dialog
{
public:
	//-------------------------------------------------------------------------
	//! @brief	各ダイアログの親となるウィンドウを指定
	//!
	//! @param	hwnd	親に設定するウィンドウハンドル
	//-------------------------------------------------------------------------
	static void SetParent(HWND hwnd);

	//-------------------------------------------------------------------------
	//! @brief	ダイアログのタイトルを指定
	//!
	//! @param	title	タイトル（静的なポインタを指定のこと）
	//-------------------------------------------------------------------------
	static void SetTitle(PCTSTR title);

	//-------------------------------------------------------------------------
	//! @brief	情報・イベントメッセージを表示
	//!
	//! @param	msg		情報・イベントメッセージ、最大1023文字
	//! @param	...		可変長引数
	//-------------------------------------------------------------------------
	static void Event(PCTSTR msg, ...);

	//-------------------------------------------------------------------------
	//! @brief	警告メッセージを表示
	//!
	//! @param	msg		警告メッセージ、最大1023文字
	//! @param	...		可変長引数
	//-------------------------------------------------------------------------
	static void Alert(PCTSTR msg, ...);

	//-------------------------------------------------------------------------
	//! @brief	エラーメッセージを表示
	//!
	//! @param	msg		エラーメッセージ、最大1023文字
	//! @param	...		可変長引数
	//-------------------------------------------------------------------------
	static void Error(PCTSTR msg, ...);

	//-------------------------------------------------------------------------
	//! @brief	ファイルを開くダイアログを表示
	//!
	//! @param	path	初期ファイルパス[in]、結果のパス[out]
	//! @param	filter	ファイルフィルタ
	//! @param	title	ダイアログのタイトル
	//!
	//! @retval	true	ファイルパスを取得した
	//! @retval	false	キャンセル or エラー
	//-------------------------------------------------------------------------
	static bool OpenFile(PTSTR path, PCTSTR filter = NULL, PCTSTR title = NULL);

	//-------------------------------------------------------------------------
	//! @brief	ファイルの保存ダイアログを表示
	//!
	//! @param	path	初期ファイルパス[in]、結果のパス[out]
	//! @param	filter	ファイルフィルタ
	//! @param	title	ダイアログのタイトル
	//!
	//! @retval	true	ファイルパスを取得した
	//! @retval	false	キャンセル or エラー
	//-------------------------------------------------------------------------
	static bool SaveFile(PTSTR path, PCTSTR filter = NULL, PCTSTR title = NULL);

	//-------------------------------------------------------------------------
	//! @brief	カラー選択ダイアログを表示
	//!
	//! @param	color	初期カラー[in]、結果のカラー[out]
	//!
	//! @retval	true	カラーを取得した
	//! @retval	false	キャンセル or エラー
	//-------------------------------------------------------------------------
	static bool SelectColor(COLORREF& color);

private:
	Dialog();
	~Dialog();
};

} //namespace wx
