//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2005 MAYO.
//=============================================================================
#pragma once

namespace wx {

//-----------------------------------------------------------------------------
//! @class	IDDEClientCallback
//! @brief	DDEを使ったファイルを開くコールバック
//-----------------------------------------------------------------------------
class IDDEClientCallback
{
public:
	//-------------------------------------------------------------------------
	//! @brief	デストラクタ
	//-------------------------------------------------------------------------
	virtual ~IDDEClientCallback() {}

	//-------------------------------------------------------------------------
	//! @brief	ファイルを開く要求コールバック
	//!
	//! @param	path		開くファイルパス
	//-------------------------------------------------------------------------
	virtual void FileOpenRequest(const wchar_t* path) = 0;
};


//-----------------------------------------------------------------------------
//! @class	DDEClient
//! @brief	DDEを使ったファイルを開く要求
//-----------------------------------------------------------------------------
class DDEClient
{
public:
	//-------------------------------------------------------------------------
	//! @brief	DDE初期化
	//!
	//! @param	service_name	サービス名
	//! @param	topic_name		トピック名
	//!
	//! @retval	true		DDEの初期化に成功
	//! @retval	false		DDEの初期化に失敗
	//-------------------------------------------------------------------------
	static bool Initialize(PCTSTR service_name, PCTSTR topic_name);

	//-------------------------------------------------------------------------
	//! @brief	DDE終了
	//-------------------------------------------------------------------------
	static void Finalize();

	//-------------------------------------------------------------------------
	//! @brief	コールバック先設定
	//!
	//! @param	cb		コールバッククラス
	//-------------------------------------------------------------------------
	static void SetCallback(IDDEClientCallback* cb);

	//-------------------------------------------------------------------------
	//! @brief	有効状態設定
	//!
	//! @param	on			有効状態
	//-------------------------------------------------------------------------
	static void SetEnable(bool on);


protected:
	// DDEコールバック関数
	static HDDEDATA CALLBACK DDEProc(UINT type, UINT fmt, HCONV conv,
			HSZ tpc1, HSZ tpc2, HDDEDATA data, DWORD data1, DWORD data2);

private:
	// インスタンス生成禁止
	DDEClient();
	~DDEClient();
};

} //namespace wx
