//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2007 MAYO.
//=============================================================================
#pragma once

namespace wx {

//-----------------------------------------------------------------------------
//! @class	EmbedResource
//! @brief	実行ファイルやDLLモジュールへの埋め込みリソース操作
//-----------------------------------------------------------------------------
class EmbedResource
{
public:
	//-------------------------------------------------------------------------
	//! @brief	デフォルトコンストラクタ
	//-------------------------------------------------------------------------
	EmbedResource();

	//-------------------------------------------------------------------------
	//! @brief	モジュールハンドル指定コンストラクタ
	//!
	//! @param	module		リソースを含むモジュールのハンドル
	//-------------------------------------------------------------------------
	EmbedResource(HMODULE module);

	//-------------------------------------------------------------------------
	//! @brief	モジュールファイル名指定コンストラクタ
	//!
	//! @param	exe_name	リソースを含むモジュールファイル名
	//-------------------------------------------------------------------------
	EmbedResource(PCTSTR exe_name);

	//-------------------------------------------------------------------------
	//! @brief	デストラクタ
	//-------------------------------------------------------------------------
	~EmbedResource();

	//-------------------------------------------------------------------------
	//! @brief	リソースIDとタイプ名をしてリソースを読み込む
	//!
	//! @param	res_id		リソースID
	//! @param	res_type	リソースタイプ名
	//!
	//! @retval	true		リソースを読み込めた
	//! @retval	false		リソースを読み込めなかった
	//-------------------------------------------------------------------------
	bool Load(UINT res_id, PCTSTR res_type);

	//-------------------------------------------------------------------------
	//! @brief	リソース名とタイプ名をしてリソースを読み込む
	//!
	//! @param	res_name	リソース名
	//! @param	res_type	リソースタイプ名
	//!
	//! @retval	true		リソースを読み込めた
	//! @retval	false		リソースを読み込めなかった
	//-------------------------------------------------------------------------
	bool Load(PCTSTR res_name, PCTSTR res_type);

	//-------------------------------------------------------------------------
	//! @brief	リソースを解放する
	//-------------------------------------------------------------------------
	void Free();

	//-------------------------------------------------------------------------
	//! @brief	リソースデータを取得
	//!
	//! @return	リソースデータ
	//-------------------------------------------------------------------------
	void* GetData() const;

	//-------------------------------------------------------------------------
	//! @brief	リソースデータのサイズを取得
	//!
	//! @return	リソースデータサイズ
	//-------------------------------------------------------------------------
	UINT  GetSize() const;

private:
	HMODULE	m_module;
	bool	m_loaded;
	HRSRC	m_rsrc;
	HGLOBAL m_hmem;
	void*	m_data;
};

} //namespace wx
