//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2007 MAYO.
//=============================================================================
#pragma once

namespace wx {

// 前方宣言
class IMsgListener;

//-----------------------------------------------------------------------------
//! @class	MsgRouter
//! @brief	ウィンドウメッセージルーター
//-----------------------------------------------------------------------------
class MsgRouter
{
public:
	//-------------------------------------------------------------------------
	//! @brief	リスナー追加
	//!
	//! @param	listener	追加するリスナー
	//-------------------------------------------------------------------------
	static void	AddListener(IMsgListener* listener);

	//-------------------------------------------------------------------------
	//! @brief	リスナー削除
	//!
	//! @param	listener	削除するリスナー
	//-------------------------------------------------------------------------
	static void RemoveListener(IMsgListener* listener);

	//-------------------------------------------------------------------------
	//! @brief	メッセージを配信する
	//!
	//! @param	msg			対象のメッセージ
	//!
	//! @retval	true		メッセージを処理した
	//! @retval	false		メッセージを処理しなかった
	//-------------------------------------------------------------------------
	static bool Dispatch(MSG& msg);

private:
	// インスタンス生成禁止
	MsgRouter();
	~MsgRouter();

	static IMsgListener* s_root;
};

//-----------------------------------------------------------------------------
//! @class	IMsgListener
//! @brief	ウィンドウメッセージを受けるための基底クラス
//-----------------------------------------------------------------------------
class IMsgListener
{
protected:
	//-------------------------------------------------------------------------
	//! @brief	コンストラクタ
	//-------------------------------------------------------------------------
	IMsgListener()
	{
		MsgRouter::AddListener(this);
	}

	//-------------------------------------------------------------------------
	//! @brief	デストラクタ
	//-------------------------------------------------------------------------
	virtual ~IMsgListener()
	{
		MsgRouter::RemoveListener(this);
	}

	//-------------------------------------------------------------------------
	//! @brief	メッセージ処理
	//!
	//! @param	msg			ウィンドウメッセージ
	//!
	//! @retval	true		メッセージを処理した
	//! @retval	false		メッセージを処理しなかった
	//-------------------------------------------------------------------------
	virtual bool ProcessMessage(MSG& msg) = 0;

private:
	friend class MsgRouter;
	IMsgListener* m_link_listener;
};

} //namespace wx
