//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2007 MAYO.
//=============================================================================

#pragma once

namespace wx {

//-----------------------------------------------------------------------------
//! @class	RefCount
//! @brief	オブジェクトの参照カウント管理テンプレート
//-----------------------------------------------------------------------------
template <class T>
class RefCount
{
public:
	//-------------------------------------------------------------------------
	//! @brief	参照を増やす
	//!
	//! @return	増やしたあとの参照カウント
	//-------------------------------------------------------------------------
	virtual int AddRef()
	{
		return ++m_ref_count;
	}

	//-------------------------------------------------------------------------
	//! @brief	参照を減らす（参照カウントがなくなったら、インスタンス破棄）
	//!
	//! @return	減らしたあとの参照カウント
	//-------------------------------------------------------------------------
	virtual int Release()
	{
		int count = --m_ref_count;
		if (count == 0) {
			delete this;
		}

		return count;
	}

	//-------------------------------------------------------------------------
	//! @brief	参照カウントを取得
	//!
	//! @return	参照カウント
	//-------------------------------------------------------------------------
	virtual int GetCount() const
	{
		return m_ref_count;
	}


protected:
	RefCount() : m_ref_count(1) {}
	virtual ~RefCount() {}

	// コピー、代入禁止
	RefCount(const RefCount&);
	T& operator = (const T&);

protected:
	int		m_ref_count;
};

} //namespace wx
