//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2009 MAYO.
//=============================================================================

#pragma once

namespace wx {

//-----------------------------------------------------------------------------
//! @class	Singleton
//! @brief	シングルトンテンプレート
//-----------------------------------------------------------------------------
template<class T>
class Singleton
{
public:
	//----------------------------------------------------------------------------
	//! @brief 唯一のインスタンス取得
	//!
	//! @return	インスタンス
	//----------------------------------------------------------------------------
	static T& GetInstance()
	{
		static T s_instance;
		return s_instance;
	}


private:
	Singleton() {}
	virtual ~Singleton() {}
};

} //namespace wx
