//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2007 MAYO.
//=============================================================================
#pragma once

namespace wx {

//-----------------------------------------------------------------------------
//! @class	ScopedLock
//! @brief	スコープで自動的にロックするユーティリティ
//-----------------------------------------------------------------------------
template <class T>
class ScopedLock
{
public:
	//-------------------------------------------------------------------------
	//! @brief	コンストラクタ
	//!
	//! @param	lock		ロックオブジェクト
	//-------------------------------------------------------------------------
	explicit ScopedLock(const T& lock)
		: m_lock(lock)
	{
		m_lock.Acquire();
	}

	//-------------------------------------------------------------------------
	//! @brief	デストラクタ
	//-------------------------------------------------------------------------
	~ScopedLock()
	{
		m_lock.Release();
	}

private:
	// コピー、代入を禁止
	ScopedLock(const ScopedLock&);
	ScopedLock& operator = (const ScopedLock&);

private:
	const T&	m_lock;
};

} //namespace wx
